/*
Транзакція - послідовність одного або декількох SQL запитів, які поєднуються в одну логічну операцію 
- Якщо всі операції будуть виконані, транзакція вважається успішною!
- Якщо провалюється, всі діє скасовуються, база даних повертається в ту форму в якій вона була до початку транзакції
*/

-- СИНТАКСИС ТРАНЗАКЦІЇ

BEGIN; -- початок транзакції
--виконуються SQL записи
COMMIT; -- зберігаємо(фіксуємо) зміни

ROLLBACK; -- скасування транзакції, відміна змін (коли помилка, щось пішло не так)

--кінець транзакції


BEGIN;

--1. створили замовлення
INSERT INTO orders (customer_id, status) VALUES
(3000, 'new')
RETURNING id;

--2. Наповнити замовлення

INSERT INTO orders_to_products(order_id, products_id, quantity ) VALUES
(LASTVAL(), 1, 1),
(LASTVAL(), 2, 3),
(LASTVAL(), 3, 1);

ROLLBACK;
